import user_1 from "../assets/dr.shreif.jpg";
import user_2 from "../assets/dr.ahmed.jpg";
import user_3 from "../assets/morad.jpg";
import user_4 from "../assets/hossam.jpg";
import user_5 from "../assets/beshoy.jpg";
import user_6 from "../assets/yassin.jpg";
import user_7 from "../assets/youssef.jpg";
import user_8 from "../assets/omar.jpg";
import user_9 from "../assets/sameh.jpg";
import user_10 from "../assets/khaled.jpg";
import user_11 from "../assets/mora.jpg";
import user_12 from "../assets/elmasry.jpg";
import user_13 from "../assets/ahmed osama.jpg";
import user_14 from "../assets/tahoun.jpg";
import user_15 from "../assets/mohmed.jpg";
import user_18 from "../assets/roaa.jpg";
import user_19 from "../assets/marim.jpg";
import user_20 from "../assets/josina.jpg";

const testimonialsData = [
  {
    id: 1,
    image: user_1,
    name: "معالي الوزير/ أ.د شريف صالح",
    role: "رئيس جامعة بورسعيد",
    quote:
      "العمل الطلابي هو أساس بناء جيل واعٍ وقادر على تحمل المسؤولية، واتحاد الطلاب هو المنصة التي تجمع الطاقات الشابة وتوجهها نحو الإبداع والتطوير. نسعى دائمًا إلى تمثيل الطلاب، دعم أفكارهم، وخلق بيئة تشجع على القيادة والمشاركة الفعالة. بالعمل الجماعي والالتزام، نصنع فرقًا حقيقيًا ونمهد الطريق لمستقبل يحمل بصمة جيل واعٍ وطموح، قادر على مواجهة التحديات وصناعة التغيير.",
  },
  {
    id: 2,
    image: user_2,
    name: "أ.م.د/أحمد بيومي",
    role: "المشرف العام على الأدارة العامة لرعاية الطلاب و منسق الأسرة بالجامعة",
    quote:
      "نحرص دائماً على رعاية طلابنا في جميع جوانب الحياة الجامعية، إيمانًا بأن النجاح الأكاديمي يجب أن يسير جنبًا إلى جنب مع التنمية الشخصية والأنشطة الطلابية. من خلال دعم المواهب، وتشجيع المبادرات، وتوفير بيئة طلابية متكاملة، نعمل على بناء جيل واعٍ قادر على تحمل المسؤولية والمساهمة في نهضة المجتمع. إننا نؤمن بأن كل طالب يحمل بداخله طاقة إبداعية قادرة على إحداث فرق، ودورنا هو توفير المساحة والدعم اللازمين لتحفيز هذه الطاقات وصقلها، ليكونوا قادة للمستقبل وسفراء للعلم والعمل في وطنهم.",
  },
  {
    id: 3,
    image: user_3,
    name: "مراد حافظ",
    role: "رئيس إتحاد طلاب جامعة بورسعيد والمنسق الطلابي للأسرة بالجامعة",
    quote:
      "في جامعة بورسعيد، نؤمن بأن العمل الطلابي هو المحرك الأساسي لتنمية مهارات الشباب وصقل شخصياتهم، فهو ليس مجرد أنشطة، بل تجربة تعزز روح القيادة، والعمل الجماعي، والانتماء. من خلال اتحاد الطلاب وأسرة 'طلاب من أجل مصر'، نعمل على خلق بيئة داعمة تُمكّن الطلاب من التعبير عن أفكارهم، وتنفيذ مبادراتهم، والمساهمة في خدمة مجتمعهم. نحن نؤمن بأن كل طالب لديه القدرة على إحداث تغيير، ودورنا هو أن نوفر له الدعم والفرص ليكون جزءًا فعالًا في بناء مستقبل أفضل لجامعتنا ووطننا.",
  },
  {
    id: 4,
    image: user_4,
    name: "يوسف حسام",
    role: "نائب رئيس إتحاد طلاب جامعة بورسعيد ونائب منسق الأسرة بالجامعة",
    quote:
      "العمل الطلابي هو أساس بناء جيل واعٍ وقادر على تحمل المسؤولية، واتحاد الطلاب هو المنصة التي تجمع الطاقات الشابة وتوجهها نحو الإبداع والتطوير. نسعى دائمًا إلى تمثيل الطلاب، دعم أفكارهم، وخلق بيئة تشجع على القيادة والمشاركة الفعالة. بالعمل الجماعي والالتزام، نصنع فرقًا حقيقيًا ونمهد الطريق لمستقبل يحمل بصمة جيل واعٍ وطموح، قادر على مواجهة التحديات وصناعة التغيير.",
  },
  {
    id: 5,
    image: user_5,
    name: "بيشوي عزمي",
    role: "نائب منسق الأسرة بالجامعة",
    quote:
      "العمل الطلابي هو المحرك الأساسي لصناعة قادة المستقبل، واتحاد الطلاب هو صوت الطلاب وشريكهم في تحقيق تطلعاتهم. نعمل معًا على تمكين الشباب، دعم أفكارهم، وتوفير بيئة تفاعلية تعزز القيادة والمسؤولية. من خلال التعاون والإبداع، نبني مجتمعًا طلابيًا واعيًا وطموحًا، قادرًا على إحداث التغيير وصنع مستقبل أفضل",
  },

  {
    id: 6,
    image: user_6,
    name: "ياسين عباس",
    role: "رئيس إتحاد كلية التمريض ونائب منسق الأسرة بالجامعة",
    quote:
      "العمل الطلابي هو أساس بناء جيل واعٍ وقادر على تحمل المسؤولية، ودورنا هو دعم الطلاب، تمثيل تطلعاتهم، والعمل على تحقيق بيئة تعزز الإبداع والمشاركة الفعالة. نسعى دائمًا إلى تمكين الشباب، تنمية مهاراتهم، وخلق فرص تتيح لهم إحداث تأثير حقيقي في مجتمعهم. بالعمل الجماعي والطموح، نصنع مستقبلًا مشرقًا يعكس روح القيادة والتغيير.",
  },
  {
    id: 7,
    image: user_7,
    name: "يوسف جاب الله",
    role: "منسق الأسرة بكلية الطب",
    quote:
      "اتحاد طلاب كلية الطب هو الداعم الأول لطلاب الكلية، نعمل على تمثيلهم، دعم أفكارهم، وتوفير بيئة تُحفّز على التعلم والتطوير. نسعى لتعزيز روح التعاون، القيادة، والمسؤولية، حتى يكون كل طالب جزءًا فاعلًا في صنع مستقبل طبي متميز يخدم المجتمع ويحقق التغيير.",
  },
  {
    id: 8,
    image: user_9,
    name: "محمد سامح",
    role: "منسق الأسرة بكلية الآداب",
    quote:
      "نحن في اتحاد طلاب كلية الآداب نؤمن بأن العمل الطلابي هو الركيزة الأساسية لصقل المهارات وتنمية القدرات. نسعى جاهدين لدعم زملائنا، تمثيلهم، وخلق بيئة تفاعلية تُشجع على الإبداع والمشاركة الفعالة. معًا، نجعل من كليتنا مساحة للحوار، التطوير، وصناعة مستقبل يليق بطموح طلابها",
  },
  {
    id: 9,
    image: user_10,
    name: "خالد محمد",
    role: "منسق الأسرة بكلية التربية",
    quote:
      "اتحاد طلاب كلية التربية هو صوت الطلاب ومنبر إبداعهم، نعمل معًا على تمكين زملائنا، دعم أفكارهم، وخلق بيئة تحفّز على التعلم والابتكار. نسعى لأن تكون كليتنا نموذجًا للريادة، حيث يجتمع العلم بالممارسة، والطموح بالمسؤولية. بالعمل الجماعي والتعاون، نبني جيلًا واعيًا قادرًا على قيادة المستقبل وصناعة التغيير.",
  },
  {
    id: 10,
    image: user_11,
    name: "عمر محمد",
    role: "منسق الأسرة بكلية الحقوق",
    quote:
      "اتحاد طلاب كلية الحقوق هو صوت الطلاب ومنصة تجمع الطاقات الشابة للدفاع عن حقوقهم وتمثيل تطلعاتهم. نعمل على تعزيز الوعي القانوني، دعم زملائنا، وتهيئة بيئة تشجع على النقاش، الإبداع، والمشاركة الفعالة. معًا، نصنع جيلًا قانونيًا واعيًا، قادرًا على تحقيق العدالة وصياغة مستقبل أفضل",
  },
  {
    id: 11,
    image: user_8,
    name: "عمر علاء",
    role: "منسق الأسرة بكلية العلاج الطبيعي",
    quote:
      "أسرة طلاب من أجل مصر كلية العلاج الطبيعي هي الداعم والممثلة لطلاب الكلية، نعمل على تمكين زملائنا، تعزيز مهاراتهم العلمية والعملية، وخلق بيئة تُشجع على الابتكار والتطوير. نسعى معًا لبناء جيل من المعالجين الفيزيائيين المتميزين، القادرين على إحداث تغيير إيجابي في المجال الطبي وخدمة المجتمع",
  },
  {
    id: 12,
    image: user_13,
    name: "أحمد أسامة",
    role: "منسق الأسرة بكلية العلوم",
    quote:
      "اتحاد طلاب كلية العلوم هو الداعم والممثل لطلاب الكلية، نعمل على تعزيز روح البحث والابتكار، ودعم زملائنا لتحقيق تطلعاتهم العلمية والعملية. نسعى لخلق بيئة تفاعلية تُشجع على التعلم، الإبداع، والعمل الجماعي، لنكون معًا جزءًا من صناعة مستقبل علمي مشرق يخدم المجتمع ويحقق التقدم",
  },
  {
    id: 13,
    image: user_12,
    name: "محمد المصري",
    role: "منسق الأسرة بكلية الصيدلة",
    quote:
      "اتحاد طلاب كلية الصيدلة هو الداعم لطلاب الكلية، نعمل على تمثيلهم، دعم أفكارهم، وتوفير بيئة تُحفّز على التعلم والابتكار. نسعى لتعزيز روح التعاون والريادة، وخلق فرص لتنمية المهارات العلمية والعملية، لنكون جزءًا من صناعة جيل صيدلي واعٍ، قادر على تحقيق التغيير وخدمة المجتمع.",
  },
  {
    id: 14,
    image: user_14,
    name: "محمود طاحون",
    role: "منسق الأسرة بكلية التجارة",
    quote:
      "اسرة طلاب من أجل مصر كلية التجارة هي الداعم والممثلة لطلاب الكلية، نعمل على تمكين زملائنا، تطوير مهاراتهم العملية والإدارية، وخلق بيئة تُحفّز على الابتكار وريادة الأعمال. معًا، نبني جيلًا من القادة الاقتصاديين القادرين على مواكبة سوق العمل وصناعة مستقبل مليء بالنجاح.",
  },
  {
    id: 15,
    image: user_15,
    name: "محمد أحمد",
    role: "منسق الأسرة بكلية تكنولوجيا الإدارة ونظم المعلومات",
    quote:
      "اسرة من اجل مصر كلية تكنولوجيا هي الداعم والممثل لطلاب الكلية، نعمل على تعزيز الابتكار، تمكين زملائنا، وخلق بيئة تُشجع على التعلم والتطوير التقني. معًا، نبني جيلًا تكنولوجيًا مبدعًا، قادرًا على مواكبة التطورات وصناعة مستقبل رقمي أكثر تقدمًا",
  },
  {
    id: 16,
    image: user_18,
    name: "رؤى حسين",
    role: "منسق الأسرة بكلية التربية النوعية",
    quote:
      "اتحاد طلاب كلية التربية النوعية هو الداعم والممثل لطلاب الكلية، نعمل على تنمية مهارات زملائنا في المجالات التربوية، الفنية، والتكنولوجية، وخلق بيئة تُشجع على الإبداع والتميز. معًا، نسعى لصناعة جيل مبدع قادر على تطوير المجتمع وإثراء المجالات النوعية المختلفة.",
  },
  {
    id: 17,
    image: user_19,
    name: "مريم كراوية",
    role: "منسق الأسرة بكلية التربية الرياضية",
    quote:
      "اتحاد طلاب كلية العلوم الرياضية هو الداعم والممثل لطلاب الكلية، نعمل على تعزيز روح المنافسة، الإبداع، والتطوير، ونسعى لخلق بيئة تشجع على التميز الأكاديمي والرياضي. معًا، نبني جيلًا قادرًا على تحقيق النجاح في مجالات العلوم والرياضة، وترك بصمة إيجابية في المجتمع",
  },
  {
    id: 18,
    image: user_20,
    name: "جوسيانا عيد",
    role: "منسق الأسرة بكلية التربية للطفولة المبكرة",
    quote:
      "اتحاد طلاب كلية تربية الطفولة المبكرة هو الداعم والممثل لطلاب الكلية، نعمل على تمكين زملائنا، تعزيز مهاراتهم التربوية، وخلق بيئة تُشجع على الإبداع في مجال تربية الأجيال. معًا، نسعى لبناء مستقبل مشرق يرتكز على أسس تربوية سليمة، تساهم في تنشئة جيل واعٍ ومبدع",
  },
];

export default testimonialsData;
