import user_1 from "../assets/dr.shreif.jpg";
import user_2 from "../assets/dr.ahmed.jpg";
import user_3 from "../assets/morad.jpg";
import user_4 from "../assets/hossam.jpg";
import user_5 from "../assets/beshoy.jpg";
import user_6 from "../assets/yassin.jpg";
import user_7 from "../assets/youssef.jpg";
import user_8 from "../assets/omar.jpg";
import user_9 from "../assets/sameh.jpg";
import user_10 from "../assets/khaled.jpg";
import user_11 from "../assets/mora.jpg";
import user_12 from "../assets/elmasry.jpg";
import user_13 from "../assets/ahmed osama.jpg";
import user_14 from "../assets/tahoun.jpg";
import user_15 from "../assets/mohmed.jpg";
import user_18 from "../assets/roaa.jpg";
import user_19 from "../assets/marim.jpg";
import user_20 from "../assets/josina.jpg";

const testimonialsData = [
  {
    id: 1,
    image: user_1,
    name: "معالي الوزير/ أ.د شريف صالح",
    role: "رئيس جامعة بورسعيد",
    quote:
      "في جامعة بورسعيد ، نؤمن بأن دور الطالب يمتد إلى ما هو أبعد من حدود الدراسة الأكاديمية. فالانتماء للوطن وخدمة المجتمع يمثلان ركيزة أساسية في بناء الشخصية القيادية والمساهمة الفاعلة في نهضة الأمة، نسعى لصقل شخصيات طلابنا ليكونوا قدوة في الإبداع، القيادة، والعطاء ، مساهمين في تحقيق مستقبل أفضل.",
  },
  {
    id: 2,
    image: user_2,
    name: "أ.م.د/أحمد بيومي",
    role: "المشرف العام على الأدارة العامة لرعاية الطلاب و منسق الأسرة بالجامعة",
    quote:
      "طلاب أسرة 'من أجل مصر' جامعة بورسعيد، أنتم مثال حي للطالب الجامعي الطموح والمبادر في خدمة مجتمعه. تفخر الجامعة بما تقدمونه من أفكار مبتكرة ومبادرات مميزة تعكس روح الانتماء والمسؤولية. استمروا في رحلتكم نحو التميز والإبداع لتحقيق مستقبل أكثر إشراقًا.",
  },
  {
    id: 3,
    image: user_3,
    name: "مراد حافظ",
    role: "رئيس إتحاد طلاب جامعة بورسعيد والمنسق الطلابي للأسرة بالجامعة",
    quote:
      "في جامعة بورسعيد، نحن لا نمثل فقط طلابًا يسعون للمعرفة، بل نمثل جيلاً يحمل طموحات كبيرة ورؤية واضحة لمستقبل أفضل، هُنا اتحاد الطلاب وأسرة طلاب من أجل مصر يمثلان طاقة لا تنضب من الإبداع والالتزام، ويقودان مسيرة التميز في الجامعة.",
  },
  {
    id: 4,
    image: user_4,
    name: "يوسف حسام",
    role: "نائب رئيس إتحاد طلاب جامعة بورسعيد ونائب منسق الأسرة بالجامعة",
    quote:
      "أسرة طلاب من أجل مصر هي المكان الذي يجتمع فيه الطموح والإبداع، حيث يسعى كل عضو لتحقيق الأفضل والمساهمة في بناء مجتمع طلابي متميز. نحن نؤمن بأن العمل الجماعي هو المفتاح للنجاح، وأن التعاون والابتكار هما الركيزتان الأساسيتان لخلق بيئة جامعية تزدهر بالأفكار الجديدة والمبادرات البناءة. معًا، نصنع الفرص ونمهد الطريق لمستقبل مشرق، حيث يكون لكل طالب دور في تحقيق التغيير الإيجابي.",
  },
  {
    id: 5,
    image: user_5,
    name: "بيشوي عزمي",
    role: "نائب منسق الأسرة بالجامعة",
    quote:
      "في أسرة طلاب من أجل مصر، نحن لا نسعى فقط لتحقيق الأفضل، بل نؤمن بأن التميز هو نهج متكامل يتطلب الالتزام والتطوير المستمر. دورنا قيادة وتوجيه، وهدفنا بناء بيئة طلابية تعاونية تمكن كل فرد من إظهار قدراته والاستفادة من إمكانياته على أكمل وجه. نحن جيل يضع التميز نصب عينيه، ويؤمن بأن كل إنجاز يبدأ بفكرة، وكل فكرة تتحول إلى واقع عندما تتضافر الجهود وتتوحد الرؤى لبناء مجتمع طلابي أكثر وعيًا وإبداعًا.",
  },

  {
    id: 6,
    image: user_6,
    name: "ياسين عباس",
    role: "رئيس إتحاد كلية التمريض ونائب منسق الأسرة بالجامعة",
    quote:
      "نؤمن بالعمل الجماعي كأساس لبناء المستقبل. دورنا تحفيز الإبداع والمساهمة الفعالة في صنع التغيير. هدفنا خلق بيئة طلابية مليئة بالفرص تساعد كل طالب على النمو والتميز.",
  },
  {
    id: 7,
    image: user_7,
    name: "يوسف جاب الله",
    role: "منسق الأسرة بكلية الطب",
    quote:
      "في كلية الطب، نهدف لتكوين جيل من الأطباء المبدعين. التميز الأكاديمي أساس نجاحنا، والعمل الجماعي يجعلنا قادرين على تحقيق أهدافنا. نعمل معًا لخدمة المرضى وتحقيق التغيير الإيجابي.",
  },
  {
    id: 8,
    image: user_9,
    name: "محمد سامح",
    role: "منسق الأسرة بكلية الآداب",
    quote:
      "في كلية الآداب، نؤمن بأن التعليم رحلة نحو تطوير الفكر والإبداع. نسعى لتمكين الطلاب من اكتساب المهارات التي تؤهلهم للمساهمة في المجتمع. العمل الجماعي أساس نجاحنا.",
  },
  {
    id: 9,
    image: user_10,
    name: "خالد محمد",
    role: "منسق الأسرة بكلية التربية",
    quote:
      "في كلية التربية، نعمل على بناء جيل من المعلمين القادرين على إحداث تأثير إيجابي. هدفنا تطوير مهارات الطلاب وتمكينهم من تحقيق التميز في التعليم. نلتزم بروح التعاون لتحقيق أهدافنا.",
  },
  {
    id: 10,
    image: user_11,
    name: "عمر محمد",
    role: "منسق الأسرة بكلية الحقوق",
    quote:
      "في كلية الحقوق، نسعى لتحقيق العدالة والمساواة. نؤمن بالالتزام بالنزاهة والمهنية، والعمل الجماعي لتعزيز فهمنا للقانون. هدفنا التأثير الإيجابي في المجتمع.",
  },
  {
    id: 11,
    image: user_8,
    name: "عمر علاء",
    role: "منسق الأسرة بكلية العلاج الطبيعي",
    quote:
      "في كلية العلاج الطبيعي، نؤمن بأن العلاج الطبيعي فن يعكس التزامنا بتحقيق الشفاء. نعد طلابنا لتقديم رعاية صحية متميزة. العمل الجماعي أساس نجاحنا.",
  },
  {
    id: 12,
    image: user_13,
    name: "أحمد أسامة",
    role: "منسق الأسرة بكلية العلوم",
    quote:
      "في كلية العلوم، نعمل على تطوير مهاراتنا العلمية والبحثية. نؤمن بالتعاون بين الطلاب لتحقيق النجاح. هدفنا بناء مجتمع علمي قوي.",
  },
  {
    id: 13,
    image: user_12,
    name: "محمد المصري",
    role: "منسق الأسرة بكلية الصيدلة",
    quote:
      "في كلية الصيدلة، نعتز بدورنا في تطوير القطاع الصحي. نعمل على تمكين الطلاب من الابتكار في مجالات الأدوية. العمل الجماعي أساس نجاحنا.",
  },
  {
    id: 14,
    image: user_14,
    name: "محمود طاحون",
    role: "منسق الأسرة بكلية التجارة",
    quote:
      "في كلية التجارة، نسعى لتمكين الطلاب من التميز في الاقتصاد والإدارة. نؤمن بالتفكير النقدي والعمل الجماعي لتحقيق التميز الأكاديمي.",
  },
  {
    id: 15,
    image: user_15,
    name: "محمد أحمد",
    role: "منسق الأسرة بكلية تكنولوجيا الإدارة ونظم المعلومات",
    quote:
      "في كلية تكنولوجيا الإدارة، نسعى لمواكبة التطورات التكنولوجية. نؤمن بالابتكار والعمل الجماعي لتحقيق النجاح. هدفنا بناء جيل قادر على قيادة التغيير.",
  },
  {
    id: 16,
    image: user_18,
    name: "رؤى حسين",
    role: "منسق الأسرة بكلية التربية النوعية",
    quote:
      "في كلية التربية النوعية، نسعى لتخريج جيل من المعلمين والفنانين المبدعين. نؤمن بالتعاون والعمل الجماعي لتحقيق النجاح الأكاديمي. هدفنا بناء مجتمع ثقافي مبدع.",
  },
  {
    id: 17,
    image: user_19,
    name: "مريم كراوية",
    role: "منسق الأسرة بكلية التربية الرياضية",
    quote:
      "في كلية التربية الرياضية، نعمل على بناء جيل من القادة الرياضيين. نؤمن بالعمل الجماعي لتحقيق التميز الرياضي. هدفنا تعزيز الصحة واللياقة في المجتمع.",
  },
  {
    id: 18,
    image: user_20,
    name: "جوسيانا عيد",
    role: "منسق الأسرة بكلية التربية للطفولة المبكرة",
    quote:
      "في كلية التربية للطفولة المبكرة، نعمل على إعداد معلمين قادرين على إحداث تغيير إيجابي. نؤمن بالتفاني في العمل لبناء شخصية المستقبل. هدفنا توفير بيئة تعليمية تنمي الإبداع.",
  },
];

export default testimonialsData;
