const PrivacyPolicy = () => {
  return (
    <div className="px-4 py-8 bg-gray-50 min-h-screen">
      <div className="max-w-3xl mx-auto bg-white p-6 rounded-lg shadow-lg">
        <h1 className="text-2xl font-bold text-center mb-6">سياسة الخصوصية</h1>
        <p className="text-sm text-gray-500 text-center mb-8">
          آخر تحديث ١٨ يناير ٢٠٢٥
        </p>

        <section className="space-y-6">
          <p className="text-lg text-gray-800">
            تنطبق سياسة الخصوصية هذه على أسرة طلاب من أجل مصر ("نحن" أو
            "خاصتنا")، وتصف كيف ولماذا قد نصل إلى معلوماتك الشخصية، نجمعها،
            نخزنها، نستخدمها، و/أو نشاركها ("نعالج") عندما تستخدم خدماتنا
            ("الخدمات")، بما في ذلك عندما تقوم بما يلي:
          </p>
          <ul className="list-disc list-inside space-y-2 text-gray-700">
            <li>
              تزور موقعنا الإلكتروني على https://for-egypt.vercel.app/، أو أي
              موقع إلكتروني خاص بنا يرتبط بهذه السياسة
            </li>
            <li>
              تتفاعل معنا بطرق أخرى ذات صلة، بما في ذلك أي مبيعات، تسويق، أو
              أحداث
            </li>
          </ul>
          <p className="text-lg text-gray-800">
            أسئلة أو مخاوف؟ قراءة سياسة الخصوصية هذه ستساعدك على فهم حقوقك
            الخصوصية وخياراتك. نحن مسؤولون عن اتخاذ القرارات حول كيفية معالجة
            معلوماتك الشخصية. إذا كنت لا توافق على سياساتنا وممارساتنا، يرجى عدم
            استخدام خدماتنا. إذا كان لديك أي أسئلة أو مخاوف، يرجى الاتصال بنا
            على kareemsleem7@gmail.com.
          </p>

          <h2 className="text-xl font-semibold text-gray-800">
            ملخص النقاط الرئيسية
          </h2>
          <p className="text-lg text-gray-800 mb-4">
            يقدم هذا الملخص النقاط الرئيسية من سياسة الخصوصية الخاصة بنا، ولكن
            يمكنك العثور على مزيد من التفاصيل حول أي من هذه المواضيع من خلال
            النقر على الرابط الموجود بعد كل نقطة رئيسية أو باستخدام جدول
            المحتويات أدناه للعثور على القسم الذي تبحث عنه.
          </p>

          <ul className="list-disc list-inside space-y-2 text-gray-700">
            <li>ما هي المعلومات الشخصية التي نعالجها؟</li>
            <li>هل نعالج أي معلومات شخصية حساسة؟</li>
            <li>هل نجمع أي معلومات من أطراف ثالثة؟</li>
            <li>كيف نعالج معلوماتك؟</li>
            <li>في أي مواقف ومع أي أطراف نشارك المعلومات الشخصية؟</li>
            <li>كيف نحافظ على أمان معلوماتك؟</li>
            <li>ما هي حقوقك؟</li>
            <li>كيف تمارس حقوقك؟</li>
            <li>هل تريد معرفة المزيد حول ما نفعله بأي معلومات نجمعها؟</li>
          </ul>

          <h2 className="text-xl font-semibold text-gray-800">
            جدول المحتويات
          </h2>
          <ul className="list-decimal list-inside space-y-2 text-gray-700">
            <li>ما هي المعلومات التي نجمعها؟</li>
            <li>كيف نعالج معلوماتك؟</li>
            <li>متى ومع من نشارك معلوماتك الشخصية؟</li>
            <li>كم من الوقت نحتفظ بمعلوماتك؟</li>
            <li>كيف نحافظ على أمان معلوماتك؟</li>
            <li>ما هي حقوقك الخصوصية؟</li>
            <li>ضوابط ميزات عدم التتبع</li>
            <li>هل نجري تحديثات على هذه الإشعار؟</li>
            <li>كيف يمكنك الاتصال بنا بخصوص هذه الإشعار؟</li>
            <li>كيف يمكنك مراجعة، تحديث، أو حذف البيانات التي نجمعها منك؟</li>
          </ul>

          <h2 className="text-xl font-semibold text-gray-800">
            1. ما هي المعلومات التي نجمعها؟
          </h2>
          <p className="text-lg text-gray-800 mb-4">
            المعلومات الشخصية التي تكشفها لنا: باختصار، نجمع المعلومات الشخصية
            التي تقدمها لنا.
          </p>
          <p className="text-lg text-gray-800 mb-4">
            نجمع المعلومات الشخصية التي تقدمها لنا طواعية عندما تعبر عن اهتمامك
            بالحصول على معلومات عنا أو عن منتجاتنا وخدماتنا، عندما تشارك في
            أنشطة على الخدمات، أو عندما تتصل بنا بخلاف ذلك.
          </p>
          <p className="text-lg text-gray-800 mb-4">
            المعلومات الشخصية التي تقدمها لنا تعتمد على سياق تفاعلاتك معنا ومع
            الخدمات، الخيارات التي تتخذها، والمنتجات والميزات التي تستخدمها. قد
            تشمل المعلومات الشخصية التي نجمعها ما يلي:
          </p>
          <ul className="list-disc list-inside space-y-2 text-gray-700 mb-4">
            <li>الأسماء</li>
            <li>أرقام الهواتف</li>
            <li>الهوية</li>
            <li>الكلية</li>
          </ul>
          <p className="text-lg text-gray-800 mb-4">
            المعلومات الحساسة: عند الضرورة، بموافقتك أو كما يسمح به القانون
            المعمول به، نعالج الفئات التالية من المعلومات الحساسة:
          </p>
          <ul className="list-disc list-inside space-y-2 text-gray-700 mb-4">
            <li>بيانات الطلاب</li>
            <li>أرقام الضمان الاجتماعي أو أي معرّفات حكومية أخرى</li>
          </ul>
          <p className="text-lg text-gray-800 mb-4">
            يجب أن تكون جميع المعلومات الشخصية التي تقدمها لنا صحيحة، كاملة،
            ودقيقة، ويجب عليك إخطارنا بأي تغييرات في هذه المعلومات الشخصية.
          </p>

          <h2 className="text-xl font-semibold text-gray-800">
            2. كيف نعالج معلوماتك؟
          </h2>
          <p className="text-lg text-gray-800 mb-4">
            باختصار: نعالج معلوماتك لتقديم، تحسين، وإدارة خدماتنا، التواصل معك،
            لأغراض الأمان ومنع الاحتيال، والامتثال للقانون. قد نعالج معلوماتك
            أيضًا لأغراض أخرى بموافقتك.
          </p>
          <p className="text-lg text-gray-800 mb-4">
            نعالج معلوماتك الشخصية لأسباب متنوعة، اعتمادًا على كيفية تفاعلك مع
            خدماتنا، بما في ذلك:
          </p>
          <ul className="list-disc list-inside space-y-2 text-gray-700 mb-4">
            <li>
              لتقديم وتسهيل تقديم الخدمات للمستخدم. قد نعالج معلوماتك لتزويدك
              بالخدمة المطلوبة.
            </li>
          </ul>

          <h2 className="text-xl font-semibold text-gray-800">
            3. متى ومع من نشارك معلوماتك الشخصية؟
          </h2>
          <p className="text-lg text-gray-800 mb-4">
            باختصار: قد نشارك المعلومات في مواقف محددة موضحة في هذا القسم و/أو
            مع الأطراف الثالثة التالية.
          </p>
          <p className="text-lg text-gray-800 mb-4">
            قد نحتاج إلى مشاركة معلوماتك الشخصية في المواقف التالية:
          </p>
          <ul className="list-disc list-inside space-y-2 text-gray-700 mb-4">
            <li>
              عمليات نقل الأعمال. قد نشارك أو ننقل معلوماتك في سياق، أو أثناء
              مفاوضات، أي اندماج، بيع أصول الشركة، تمويل، أو استحواذ على كل أو
              جزء من أعمالنا إلى شركة أخرى.
            </li>
            <li>
              الشركات التابعة. قد نشارك معلوماتك مع شركاتنا التابعة، وفي هذه
              الحالة سنطلب من هذه الشركات التابعة احترام سياسة الخصوصية هذه.
            </li>
          </ul>

          <h2 className="text-xl font-semibold text-gray-800">
            4. كم من الوقت نحتفظ بمعلوماتك؟
          </h2>
          <p className="text-lg text-gray-800 mb-4">
            باختصار: نحتفظ بمعلوماتك طالما كان ذلك ضروريًا لتحقيق الأغراض
            الموضحة في سياسة الخصوصية هذه ما لم يقتضي القانون خلاف ذلك.
          </p>
          <p className="text-lg text-gray-800 mb-4">
            سنحتفظ بمعلوماتك الشخصية فقط طالما كان ذلك ضروريًا للأغراض الموضحة
            في سياسة الخصوصية هذه، ما لم تكن هناك فترة احتفاظ أطول مطلوبة أو
            مسموح بها بموجب القانون.
          </p>

          <h2 className="text-xl font-semibold text-gray-800">
            5. كيف نحافظ على أمان معلوماتك؟
          </h2>
          <p className="text-lg text-gray-800 mb-4">
            باختصار: نهدف إلى حماية معلوماتك الشخصية من خلال نظام من الإجراءات
            الأمنية التنظيمية والفنية.
          </p>
          <p className="text-lg text-gray-800 mb-4">
            اتخذنا التدابير الأمنية اللازمة لحماية معلوماتك الشخصية من الضياع،
            الاستخدام غير المصرح به، والوصول غير المصرح به، التغيير، والكشف. ومع
            ذلك، يرجى ملاحظة أنه لا يوجد نظام أمني مثالي أو لا يمكن اختراقه.
          </p>
        </section>
      </div>
    </div>
  );
};

export default PrivacyPolicy;
