// eslint-disable-next-line
import React, { useRef } from "react";
import "./Testimonials.css";
import next_icon from "../../assets/next-icon.png";
import back_icon from "../../assets/back-icon.png";
import user_1 from "../../assets/dr.shreif.jpg";
import user_2 from "../../assets/dr.ahmed.jpg";
import user_3 from "../../assets/morad.jpg";
import user_4 from "../../assets/hossam.jpg";
import user_5 from "../../assets/beshoy.jpg";
import user_6 from "../../assets/yassin.jpg";
import user_7 from "../../assets/youssef.jpg";
import user_8 from "../../assets/omar.jpg";
import user_9 from "../../assets/sameh.jpg";
import user_10 from "../../assets/khaled.jpg";
import user_11 from "../../assets/mora.jpg";
import user_12 from "../../assets/elmasry.jpg";
import user_13 from "../../assets/ahmed osama.jpg";
import user_14 from "../../assets/tahoun.jpg";
import user_15 from "../../assets/mohmed.jpg";
import user_16 from "../../assets/about.png";
import user_17 from "../../assets/about.png";
import user_18 from "../../assets/roaa.jpg";
import user_19 from "../../assets/marim.jpg";
import user_20 from "../../assets/josina.jpg";
import Image from "next/image";

const Testimonials = () => {
  const slider = useRef();
  let tx = 0;

  const slideForward = () => {
    if (tx > -90) {
      tx -= 5;
    }
    slider.current.style.transform = `translateX(${tx}%)`;
  };
  const slideBackward = () => {
    if (tx < 0) {
      tx += 5;
    }
    slider.current.style.transform = `translateX(${tx}%)`;
  };

  return (
    <section className="testimonials mx-[7%] py-20 ">
      <Image
        src={next_icon}
        alt=""
        className="next-btn"
        onClick={slideForward}
      />
      <Image
        src={back_icon}
        alt=""
        className="back-btn"
        onClick={slideBackward}
      />
      <div className="slider">
        <ul ref={slider}>
          <li>
            <div className="slide">
              <div className="user-info">
                <Image src={user_1} alt="" />
                <div className="text-center">
                  <h3 className="mb-2"> معالي الوزير/ أ.د شريف صالح</h3>
                  <span>رئيس جامعة بورسعيد</span>
                  <p></p>
                  {/* <span> و منسق الأسرة بالجامعة </span> */}
                </div>
              </div>
              <p className="mt-[7px] text-center">
                "في جامعة بورسعيد، نؤمن أن دور الطالب يتجاوز حدود الدراسة
                الأكاديمية ليشمل المساهمة الفعالة في بناء مستقبل الوطن بأفكاره
                وإبداعاته. أنتم قادة الغد، ومصدر الإلهام والتغيير الذي نطمح
                إليه. نحن هنا لدعمكم في رحلتكم العلمية والعملية، وتزويدكم بكل ما
                تحتاجونه من معارف ومهارات لتكونوا صناعًا للابتكار وقادة للتقدم.
                من خلال ما نقدمه من برامج أكاديمية وأنشطة متنوعة، نسعى لتعزيز
                قيم العمل الجماعي، والمسؤولية المجتمعية بين طلابنا. أنتم الركيزة
                الأساسية في تحقيق رؤية الجامعة ورسالتها نحو مستقبل أكثر إشراقًا
                وازدهارًا. أتمنى لكم مسيرة مليئة بالإنجازات والنجاحات، وكونوا
                دائمًا على يقين أن الجامعة تدعم طموحاتكم وتسعى لتحقيق أحلامكم."
              </p>
            </div>
          </li>

          <li>
            <div className="slide">
              <div className="user-info">
                <Image src={user_2} alt="" />
                <div className="text-center">
                  <h3 className="mb-2"> أ.م.د/أحمد بيومي</h3>
                  <span>المشرف العام على الأدارة العامة لرعاية الطلاب</span>
                  <p></p>
                  <span> و منسق الأسرة بالجامعة </span>
                </div>
              </div>
              <p className="mt-[7px] text-center">
                {" "}
                "طلاب أسرة طلاب من أجل مصر بجامعة بورسعيد، أنتم النواة الحقيقية
                للعمل الطلابي البناء الذي يعكس روح الإبداع والانتماء للوطن.
                وجودكم ضمن هذه الأسرة يجسد صورة نموذجية للطالب الجامعي الذي لا
                يكتفي بالتحصيل العلمي فقط، بل يسهم أيضًا في خدمة مجتمعه وتعزيز
                قيم الوحدة والعمل الجماعي. إننا في جامعة بورسعيد نفتخر بكم وبما
                تقدمونه من أفكار ومبادرات تعكس وعيكم بدوركم كجزء من هذا المجتمع.
                أنتم أمل المستقبل وحجر الأساس في بناء وطن قوي يقوم على الشباب
                الواعد والطموح. أدعوكم لمواصلة السعي نحو التميز والإبداع، ثقوا
                دائمًا أنكم في أيدٍ داعمة تشجعكم على المضي قدمًا لتحقيق أحلامكم
                وخدمة وطننا الحبيب."
              </p>
            </div>
          </li>

          <li>
            <div className="slide">
              <div className="user-info">
                <Image src={user_3} alt="" />
                <div className="text-center">
                  <h3 className="bold mb-1">مراد حافظ</h3>
                  <span>رئيس إتحاد طلاب جامعة بورسعيد</span>
                  <p></p>
                  <span> والمنسق الطلابي للأسرة بالجامعة </span>
                </div>
              </div>
              <p className="mt-[5px] text-center">
                "في جامعة بورسعيد، نحن لا نمثل فقط طلابًا يسعون للمعرفة، بل نمثل
                جيلاً يحمل طموحات كبيرة ورؤية واضحة لمستقبل أفضل، هُنا اتحاد
                الطلاب وأسرة طلاب من أجل مصر يمثلان طاقة لا تنضب من الإبداع
                والالتزام، ويقودان مسيرة التميز في الجامعة. هدفنا ليس فقط النجاح
                الأكاديمي، بل أن نكون قوة تغيير إيجابية ، مُتكاتفون نساهم جميعاً
                في بناء وطن قوي ومزدهر ، نحمل في طياتنا رؤية وأهداف جديدة ترتكز
                على تعزيز قيم الانتماء والعمل الجماعي، وإطلاق الطاقات الكامنة في
                كل طالب لتحقيق إنجازات تليق بمكانة جامعتنا. معًا نصنع مستقبلًا
                نتفاخر به، تقوده عقول واعية وطموحات لا تعرف المستحيل، في ظل
                إدارة حكيمة تؤمن بقدراتنا وتدعم خطواتنا."
              </p>
            </div>
          </li>

          <li>
            <div className="slide">
              <div className="user-info">
                <Image src={user_4} alt="" />
                <div className="text-center">
                  <h3 className="bold mb-2">يوسف حسام</h3>
                  <span> نائب رئيس إتحاد طلاب جامعة بورسعيد </span>
                  <p></p>
                  <span> ونائب منسق الأسرة بالجامعة </span>
                </div>
              </div>
              <p className="mt-[7px] text-center">
                "أسرة طلاب من أجل مصر هي المكان الذي يجتمع فيه الطموح والإبداع،
                حيث يسعى كل عضو لتحقيق الأفضل والمساهمة في بناء مجتمع طلابي
                متميز. نحن نؤمن بأن العمل الجماعي هو المفتاح للنجاح، وأن لكل
                طالب دورًا كبيرًا في تحقيق أهدافنا المشتركة. دورنا في هذه الأسرة
                يتجاوز المساهمة في الأنشطة؛ نحن نسعى إلى خلق بيئة محفزة تتيح لكل
                فرد أن يحقق إمكانياته الكاملة ويشارك في تطوير جامعتنا. رؤية أسرة
                طلاب من أجل مصر هي بناء جيل واعٍ وطموح قادر على مواجهة التحديات
                وتحقيق التغيير. معًا نواصل بناء المستقبل، مدفوعين بالإرادة
                والعزيمة، لنبني مجتمعًا طلابيًا يُفتخر به وتظل بصمته واضحة في
                تاريخ جامعة بورسعيد."
              </p>
            </div>
          </li>

          <li>
            <div className="slide">
              <div className="user-info">
                <Image src={user_5} alt="" />
                <div className="text-center">
                  <h3 className="mb-3">بيشوي عزمي</h3>
                  <span> نائب منسق الأسرة بالجامعة </span>
                  <p></p>
                  <br />
                </div>
              </div>
              <p className="mt-[5px] text-center">
                "في أسرة طلاب من أجل مصر، نحن دائمًا نسعى لتحقيق الأفضل، ونفخر
                بأننا جزء من مجتمع يزرع فيه كل طالب بذور الإبداع والعمل الجماعي.
                دورنا لا يقتصر على المشاركة، بل على القيادة والتوجيه، من خلال
                العمل المشترك الذي يحقق أهدافنا ويخدم مصلحة الجميع. هدفنا هو
                بناء بيئة طلابية مليئة بالتعاون والتطور، حيث يتمكن كل فرد من
                إظهار قدراته وإسهاماته في بناء مستقبل أفضل لجامعتنا ووطننا. نحن
                نمثل الجيل الذي يضع نصب عينيه تحقيق التميز، ويواصل العمل لتحقيق
                رؤى جديدة ومتجددة. معًا، نواصل المسيرة، ونعمل بروح الفريق الواحد
                لتحقيق النجاح وإحداث تغيير حقيقي يدوم طويلًا."
              </p>
            </div>
          </li>

          <li>
            <div className="slide">
              <div className="user-info">
                <Image src={user_6} alt="" />
                <div className="text-center">
                  <h3 className="mb-2">ياسين عباس</h3>
                  <span>رئيس إتحاد كليةالتمريض</span>
                  <p></p>
                  <span> ونائب منسق الأسرة بالجامعة </span>
                </div>
              </div>
              <p className="mt-[7px] text-center">
                "في أسرة طلاب من أجل مصر، نؤمن بأن العمل الجماعي هو الأساس الذي
                نبني عليه مستقبلنا، ونفخر بأننا جزء من أسرة تهدف إلى تمكين
                الطلاب وتطويرهم. دورنا لا يقتصر على المشاركة في الفعاليات، بل
                يمتد إلى تحفيز الجميع على الإبداع والمساهمة الفعالة في صنع
                التغيير. هدفنا هو خلق بيئة طلابية مليئة بالفرص والإمكانات التي
                تساعد كل طالب على النمو والتميز. نحن نعمل بروح الفريق الواحد،
                حيث يسهم كل عضو في تحقيق الأهداف المشتركة التي تخدم الجامعة
                والمجتمع. معًا، نواصل رحلتنا نحو مستقبل مشرق، متسلحين بالأمل
                والإصرار لتحقيق النجاح، وترك بصمة لا تُنسى في تاريخ جامعة
                بورسعيد."
              </p>
            </div>
          </li>

          <li>
            <div className="slide">
              <div className="user-info">
                <Image src={user_7} alt="" />
                <div className="text-center">
                  <h3 className="bold mb-2">يوسف جاب الله</h3>
                  <span> منسق الأسرة بكلية الطب </span>
                </div>
              </div>
              <p className="mt-[7px] text-center">
                "في كلية الطب بجامعة بورسعيد، نحن لا نقتصر على دراسة العلوم
                الطبية فقط، بل نهدف إلى تكوين جيل من الأطباء المبدعين الذين
                يسهمون في تحسين جودة الرعاية الصحية . التميز الأكاديمي هو أساس
                نجاحنا، ولكننا أيضًا نؤمن بأن روح التعاون والعمل الجماعي هي ما
                يجعلنا قادرين على تحقيق أهدافنا والمساهمة في تطوير المجتمع.
                الانتماء إلى هذه الكلية يتطلب منا الالتزام بالمبادئ العلمية
                والأخلاقية، والعمل بكل طاقتنا من أجل خدمة المرضى وتحقيق التغيير
                الإيجابي في المجال الطبي. دعونا نعمل معًا بروح الفريق الواحد،
                لتكون كلية الطب مثالاً للتفوق والإبداع ، ولنسهم في رسم مستقبل
                أفضل لوطننا."
              </p>
            </div>
          </li>

          <li>
            <div className="slide">
              <div className="user-info">
                <Image src={user_9} alt="" />
                <div className="text-center">
                  <h3 className="bold mb-2">محمد سامح</h3>
                  <span> منسق الأسرة بكلية الآداب </span>
                </div>
              </div>
              <p className="mt-[7px] text-center">
                "في كلية الآداب بجامعة بورسعيد، نؤمن بأن التعليم ليس مجرد تحصيل
                معرفي، بل هو رحلة نحو تطوير الفكر والإبداع. نسعى دائمًا إلى
                تمكين طلابنا من اكتساب المهارات اللازمة التي تؤهلهم للمساهمة
                الفعالة في المجتمع. الانتماء إلى كلية الآداب يتطلب منا تعزيز قيم
                التعاون والعمل الجماعي، حيث أن كل طالب في هذه الكلية له دور كبير
                في إثراء البيئة الأكاديمية. فلنواصل العمل معًا، لنبني مجتمعًا
                طلابيًا قادرًا على تقديم حلول مبتكرة في مجالاتنا المختلفة."
              </p>
            </div>
          </li>

          <li>
            <div className="slide">
              <div className="user-info">
                <Image src={user_10} alt="" />
                <div className="text-center">
                  <h3 className="bold mb-2">خالد محمد</h3>
                  <span> منسق الأسرة بكلية التربية </span>
                </div>
              </div>
              <p className="mt-[7px] text-center">
                "في كلية التربية بجامعة بورسعيد، نُدرك أن رسالتنا تتجاوز التعليم
                الأكاديمي، بل نحن نعمل على بناء جيل من المعلمين القادرين على
                إحداث تأثير إيجابي في المجتمع. نسعى لتطوير مهارات الطلاب
                وتمكينهم من تحقيق التميز في مجالات التعليم والتوجيه. الانتماء
                إلى كلية التربية هو التزام بتطوير الأجيال القادمة من خلال
                التعليم الفعّال والعمل المشترك. دعونا نعمل معًا، ملتزمين بروح
                التعاون، لتحقيق أهدافنا في تقديم أفضل خدمة تربوية للمجتمع
                والوطن."
              </p>
            </div>
          </li>

          <li>
            <div className="slide">
              <div className="user-info">
                <Image src={user_11} alt="" />
                <div className="text-center">
                  <h3 className="bold mb-2">عمر محمد</h3>
                  <span> منسق الأسرة بكلية الحقوق </span>
                </div>
              </div>
              <p className="mt-[7px] text-center">
                "في كلية الحقوق بجامعة بورسعيد، نؤمن بأننا لا نُعد فقط محامين
                ومستشارين قانونيين، بل نحن طلاب يسعون لتحقيق العدالة والمساواة
                في المجتمع من خلال تمكين أنفسنا بالمعرفة القانونية وتطبيقها في
                خدمة الوطن. الانتماء إلى كلية الحقوق يتطلب منا الالتزام بأعلى
                معايير النزاهة والمهنية، والعمل الجماعي الذي يعزز من فهمنا
                للقانون وقدرتنا على التأثير الإيجابي في المجتمع. دعونا نواصل
                العمل معًا بروح التعاون والتفاني، لنساهم في بناء مجتمع قانوني
                عادل يعكس قيمنا الإنسانية والعدلية."
              </p>
            </div>
          </li>

          <li>
            <div className="slide">
              <div className="user-info">
                <Image src={user_8} alt="" />
                <div className="text-center">
                  <h3 className="bold mb-2">عمر علاء</h3>
                  <span> منسق الأسرة بكلية العلاج الطبيعي </span>
                </div>
              </div>
              <p className="mt-[7px] text-center">
                "في كلية العلاج الطبيعي بجامعة بورسعيد، نؤمن بأن العلاج الطبيعي
                ليس فقط علمًا، بل فنًا يعكس التزامنا بتحقيق الشفاء وتحسين جودة
                حياة الأفراد. نحن نعد طلابنا ليكونوا محترفين قادرين على تقديم
                الرعاية الصحية المتميزة باستخدام الأساليب العلاجية الحديثة التي
                تساهم في إعادة التأهيل وتحسين الحركة. الانتماء إلى كلية العلاج
                الطبيعي يتطلب منا التفاني في التعلم والتطبيق المستمر، والعمل
                بروح التعاون من أجل تقديم أفضل الخدمات للمرضى. دعونا نواصل معًا
                سعيَنا لتحقيق التميز في هذا المجال، ونساهم في تحسين صحة المجتمع
                ورفع مستوى الرعاية الصحية."
              </p>
            </div>
          </li>

          <li>
            <div className="slide">
              <div className="user-info">
                <Image src={user_13} alt="" />
                <div className="text-center">
                  <h3 className="bold mb-2">أحمد أسامة</h3>
                  <span> منسق الأسرة بكلية العلوم </span>
                </div>
              </div>
              <p className="mt-[7px] text-center">
                "في كلية العلوم بجامعة بورسعيد، نعتز بتخصصنا في المجالات العلمية
                التي تشكل أساس التطور والتقدم في مختلف قطاعات الحياة. نحن هنا
                نعمل جاهدين لتطوير مهاراتنا العلمية والبحثية، ونحرص على تبني
                أحدث الأساليب والتقنيات لتقديم معرفة متقدمة تساهم في بناء مجتمع
                علمي قوي. الانتماء إلى كلية العلوم يتطلب منا العمل الجماعي
                المستمر، حيث أن التعاون بين الطلاب يسهم في تبادل المعرفة وتحقيق
                النجاح. فلنواصل الجهود معًا، ونسعى لتحقيق التميز في جميع
                مجالاتنا العلمية، لنبني مستقبلًا مشرقًا لوطننا."
              </p>
            </div>
          </li>

          <li>
            <div className="slide">
              <div className="user-info">
                <Image src={user_12} alt="" />
                <div className="text-center">
                  <h3 className="bold mb-2">محمد المصري</h3>
                  <span> منسق الأسرة بكلية الصيدلة </span>
                </div>
              </div>
              <p className="mt-[7px] text-center">
                "في كلية الصيدلة بجامعة بورسعيد، نعتز بدورنا الحيوي في تطوير
                القطاع الصحي من خلال تدريب الأجيال القادمة من الصيادلة
                المتميزين. نحن نسعى لتمكين طلابنا من اكتساب المهارات العلمية
                والتطبيقية اللازمة للابتكار في مجالات الأدوية والعلاج. الانتماء
                إلى كلية الصيدلة يتطلب منا العمل بروح الفريق الواحد، حيث يسهم كل
                طالب في تعزيز بيئة علمية مشجعة على البحث والاكتشاف. دعونا نواصل
                تحقيق التفوق الأكاديمي والمساهمة الفعالة في تطوير الرعاية
                الصحية، لبناء مستقبل أفضل لصحة المجتمع والوطن."
              </p>
            </div>
          </li>

          <li>
            <div className="slide">
              <div className="user-info">
                <Image src={user_14} alt="" />
                <div className="text-center">
                  <h3 className="bold mb-2">محمود طاحون</h3>
                  <span> منسق الأسرة بكلية التجارة </span>
                </div>
              </div>
              <p className="mt-[7px] text-center">
                "في كلية التجارة بجامعة بورسعيد، نحن نعمل على تزويد طلابنا
                بالمعرفة والمهارات التي تؤهلهم للتميز في مجالات الاقتصاد
                والإدارة والمالية. نسعى دائمًا إلى خلق بيئة تعليمية تحفز على
                التفكير النقدي وتطوير الحلول المبتكرة التي تلبي احتياجات السوق.
                الانتماء إلى كلية التجارة يتطلب منا الالتزام بالعمل الجماعي
                والتعاون المستمر، حيث أن كل طالب له دور مهم في تحقيق التميز
                الأكاديمي والإسهام في التطوير المهني. فلنواصل معًا سعيَنا نحو
                التفوق، لنكون قادة في مجالاتنا ونساهم في بناء اقتصاد قوي ومستدام
                للوطن."
              </p>
            </div>
          </li>

          <li>
            <div className="slide">
              <div className="user-info">
                <Image src={user_15} alt="" />
                <div className="text-center">
                  <h3 className="bold mb-2">محمد أحمد</h3>
                  <span>
                    {" "}
                    منسق الأسرة بكلية تكنولوجيا الادارة ونظم المعلومات{" "}
                  </span>
                </div>
              </div>
              <p className="mt-[7px] text-center">
                "في كلية تكنولوجيا الإدارة ونظم المعلومات بجامعة بورسعيد، نحن
                نسعى لتزويد طلابنا بالمعرفة والمهارات اللازمة لمواكبة أحدث
                التطورات في مجالات تكنولوجيا المعلومات والإدارة. نحن نؤمن بأن
                الابتكار والتفكير النقدي هما أساس نجاحنا في بناء جيل قادر على
                قيادة التغيير في العالم الرقمي. الانتماء إلى هذه الكلية يتطلب
                منا العمل الجماعي والتعاون المستمر، حيث أن كل طالب لديه القدرة
                على إحداث فرق في تطوير الحلول التكنولوجية والإدارية. دعونا نواصل
                العمل معًا، لتحقيق التفوق والإبداع في مجالاتنا، لنساهم في بناء
                مجتمع رقمي يواكب المستقبل."
              </p>
            </div>
          </li>

          <li>
            <div className="slide">
              <div className="user-info">
                <Image src={user_16} alt="" />
                <div className="text-center">
                  <h3 className="bold mb-2">مورووو</h3>
                  <span> منسق الأسرة بكلية الهندسة</span>
                </div>
              </div>
              <p className="mt-[7px] text-center">
                "في كلية الهندسة بجامعة بورسعيد، نحن نعد أنفسنا لتحديات المستقبل
                من خلال تسليح طلابنا بالمعرفة والمهارات الهندسية التي تمكنهم من
                تصميم الحلول المبتكرة التي تخدم المجتمع وتساهم في تقدم الوطن.
                نحن نؤمن بأن الهندسة ليست مجرد علم، بل هي فن في حل المشكلات
                وتحقيق التقدم التكنولوجي. الانتماء إلى كلية الهندسة يتطلب منا
                التعاون والعمل الجماعي المستمر، حيث أن كل طالب له دور في دفع
                عجلة الابتكار والتطور. دعونا نواصل معًا مسيرتنا نحو التميز،
                ولنكن دائمًا على قدر المسؤولية في بناء عالم أفضل من خلال الحلول
                الهندسية المبدعة."
              </p>
            </div>
          </li>

          <li>
            <div className="slide">
              <div className="user-info">
                <Image src={user_17} alt="" />
                <div className="text-center">
                  <h3 className="bold mb-2"> مورووو </h3>
                  <span> منسق الأسرة بكلية التمريض</span>
                </div>
              </div>
              <p className="mt-[7px] text-center">
                "في كلية التمريض بجامعة بورسعيد، نحن نعمل على تزويد طلابنا
                بالمعرفة والمهارات اللازمة لتقديم الرعاية الصحية المثلى،
                فالتعليم التمريضي هو أساس بناء مجتمع صحي. نحن لا نعلم فقط كيفية
                تقديم العلاج، بل نغرس في طلابنا قيم الإنسانية والرعاية التي
                تلامس حياة الناس بشكل مباشر. الانتماء إلى كلية التمريض يتطلب منا
                العمل بروح الفريق والالتزام بمبادئ التمريض التي تضع مصلحة المريض
                في المقام الأول. دعونا نواصل العمل معًا، لنبني مستقبلًا مشرقًا
                في مجال التمريض، يساهم في تحسين صحة المجتمع ويسهم في تقديم رعاية
                صحية متميزة."
              </p>
            </div>
          </li>

          <li>
            <div className="slide">
              <div className="user-info">
                <Image src={user_18} alt="" />
                <div className="text-center">
                  <h3 className="bold mb-2">رؤى حسين</h3>
                  <span> منسق الأسرة بكلية التربية النوعية </span>
                </div>
              </div>
              <p className="mt-[7px] text-center">
                "في كلية التربية النوعية بجامعة بورسعيد، نعمل على تزويد طلابنا
                بالمعرفة والمهارات اللازمة لإبداع وتطوير مجالات التربية الفنية
                والموسيقية والإعلامية. نحن نسعى لتخريج جيل من المعلمين والفنانين
                القادرين على استخدام الإبداع في تعليم الأجيال القادمة. الانتماء
                إلى كلية التربية النوعية يتطلب منا أن نكون دائمًا في قلب
                التغيير، من خلال التعاون والعمل الجماعي الذي يساهم في إثراء
                مجالاتنا وتحقيق النجاح الأكاديمي. دعونا نواصل العمل معًا، لتحقيق
                التفوق والإبداع في المجالات الفنية والتربوية، ونساهم في بناء
                مجتمع ثقافي مبدع وملهم."
              </p>
            </div>
          </li>

          <li>
            <div className="slide">
              <div className="user-info">
                <Image src={user_19} alt="" />
                <div className="text-center">
                  <h3 className="bold mb-2">مريم كراوية</h3>
                  <span> منسق الأسرة بكلية التربية الرياضية </span>
                </div>
              </div>
              <p className="mt-[7px] text-center">
                "في كلية التربية الرياضية بجامعة بورسعيد، نحن لا نقتصر على تعليم
                الرياضة فقط، بل نعمل على بناء جيل من القادة الرياضيين الذين
                يسهمون في تعزيز الصحة واللياقة البدنية في المجتمع. نسعى دائمًا
                لتطوير مهارات الطلاب وتوجيههم ليكونوا مثالًا يحتذى به في التفاني
                والالتزام بالرياضة. الانتماء إلى كلية التربية الرياضية يتطلب منا
                العمل الجماعي وروح الفريق، حيث أن النجاح في هذا المجال يعتمد على
                التعاون المستمر والتطوير المتبادل. دعونا نواصل معًا سعيَنا
                لتحقيق التميز الرياضي، لنساهم في بناء مجتمع صحي ونشيط يواكب
                المستقبل."
              </p>
            </div>
          </li>

          <li>
            <div className="slide">
              <div className="user-info">
                <Image src={user_20} alt="" />
                <div className="text-center">
                  <h3 className="bold mb-2">جوسيانا عيد</h3>
                  <span> منسق الأسرة بكلية التربية للطفولة المبكرة </span>
                </div>
              </div>
              <p className="mt-[7px] text-center">
                "في كلية التربية للطفولة المبكرة بجامعة بورسعيد، نعمل على إعداد
                جيل من المعلمين القادرين على إحداث تغيير إيجابي في حياة الأطفال
                من خلال تقديم التعليم والتوجيه المناسب في مرحلة مبكرة. نحن نؤمن
                بأن الطفولة هي الأساس لبناء شخصية المستقبل، وأن دورنا هو تمكين
                طلابنا من اكتساب المهارات اللازمة لتوفير بيئة تعليمية تنمي
                القدرات والإبداع. الانتماء إلى كلية التربية للطفولة المبكرة
                يتطلب منا التفاني في العمل ورؤية شاملة لأهمية الدور التربوي في
                تشكيل أجيال قادرة على مواجهة تحديات المستقبل. دعونا نعمل معًا
                بروح التعاون، لنقدم أفضل ما لدينا من أجل الأطفال ومستقبلهم."
              </p>
            </div>
          </li>
        </ul>
      </div>
    </section>
  );
};

export default Testimonials;
